# Local Variables:
# org-ref-default-bibliography ("bib/refs.bib")
# org-latex-image-default-width nil
# org-latex-caption-above nil
# org-latex-hyperref-template "\\hypersetup{\n pdfauthor={%a},\n pdftitle={%t},\n pdfkeywords={%k},\n pdfsubject={%d},\n pdfcreator={%c},\n pdflang={%L},\n unicode={true}\n}\n\\setdefaultlanguage{%l}\n"
# org-export-latex-tables-hline "\\midrule"
# org-export-latex-tables-tstart "\\toprule"
# org-export-latex-tables-tend "\\bottomrule"
# eval: (add-to-list 'org-latex-classes '("gost" "\\documentclass{gost} [DEFAULT-PACKAGES] [PACKAGES] [EXTRA]" ("\\section{%s}" . "\\section*{%s}") ("\\subsection{%s}" . "\\subsection*{%s}") ("\\subsubsection{%s}" . "\\subsubsection*{%s}") ("\\paragraph{%s}" . "\\paragraph*{%s}") ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
# End:

#+TITLE: High-performance sea wave simulation model for studying marine object behaviour
#+AUTHOR: Ivan Gankevich
#+DATE: St. Petersburg, 2017
#+LANGUAGE: en
#+LATEX_CLASS: gost
#+LATEX_CLASS_OPTIONS: [hidelinks,fontsize=14pt,paper=a4,pagesize,DIV=calc,noenddot]
#+LATEX_HEADER_EXTRA: \input{preamble}
#+LATEX_HEADER_EXTRA: \organization{Saint Petersburg State University}
#+LATEX_HEADER_EXTRA: \manuscript{}
#+LATEX_HEADER_EXTRA: \degree{thesis for candidate of sciences degree}
#+LATEX_HEADER_EXTRA: \speciality{Speciality 05.13.18\\Mathematical modeling, numerical methods and programme complexes}
#+LATEX_HEADER_EXTRA: \supervisor{Supervisor\\Alexander Degtyarev}
#+LATEX_HEADER_EXTRA: \newcites{published}{Publications on the subject of thesis}
#+OPTIONS: todo:nil title:nil ':t H:5
#+STARTUP: indent
#+PROPERTY: header-args:R :results graphics :exports results

** Produce data for Q-Q, ACF and velocity potential plots
#+begin_src sh :exports none :results verbatim
root=$(pwd)
for testname in \
    propagating_wave \
    standing_wave \
    plain_wave_linear_solver \
    plain_wave_high_amplitude_solver
do
    wd=$root/build/$testname
    rm -rf $wd
    mkdir -p $wd
    cd $wd
    cp $root/config/mt.dat .
    arma -c $root/config/$testname.arma 2>&1
done
#+end_src

#+RESULTS:
#+begin_example
Input file                     = /home/igankevich/workspace/arma-thesis/config/propagating_wave.arma
Output grid size               = (200,40,40)
Output grid patch size         = (1,1,1)
Model                          = MA
Verification scheme            = manual
MA model                       = order=(20,10,10),acf.shape=(20,10,10),algorithm=fixed_point_iteration
ACF variance = 5
fixed_point_iteration:Iteration=0, var_wn=2.70831
fixed_point_iteration:Iteration=1, var_wn=1.93791
fixed_point_iteration:Iteration=2, var_wn=1.54801
fixed_point_iteration:Iteration=3, var_wn=1.31202
fixed_point_iteration:Iteration=4, var_wn=1.15328
fixed_point_iteration:Iteration=5, var_wn=1.0386
fixed_point_iteration:Iteration=6, var_wn=0.951442
fixed_point_iteration:Iteration=7, var_wn=0.882674
fixed_point_iteration:Iteration=8, var_wn=0.82688
fixed_point_iteration:Iteration=9, var_wn=0.780623
fixed_point_iteration:Iteration=10, var_wn=0.74161
fixed_point_iteration:Iteration=11, var_wn=0.708244
fixed_point_iteration:Iteration=12, var_wn=0.679374
fixed_point_iteration:Iteration=13, var_wn=0.654145
fixed_point_iteration:Iteration=14, var_wn=0.63191
fixed_point_iteration:Iteration=15, var_wn=0.612168
fixed_point_iteration:Iteration=16, var_wn=0.594523
fixed_point_iteration:Iteration=17, var_wn=0.578663
fixed_point_iteration:Iteration=18, var_wn=0.564333
fixed_point_iteration:Iteration=19, var_wn=0.551325
fixed_point_iteration:Iteration=20, var_wn=0.539469
fixed_point_iteration:Iteration=21, var_wn=0.528623
fixed_point_iteration:Iteration=22, var_wn=0.518666
fixed_point_iteration:Iteration=23, var_wn=0.509497
fixed_point_iteration:Iteration=24, var_wn=0.50103
fixed_point_iteration:Iteration=25, var_wn=0.493191
fixed_point_iteration:Iteration=26, var_wn=0.485915
fixed_point_iteration:Iteration=27, var_wn=0.479148
fixed_point_iteration:Iteration=28, var_wn=0.472841
fixed_point_iteration:Iteration=29, var_wn=0.466951
fixed_point_iteration:Iteration=30, var_wn=0.461442
fixed_point_iteration:Iteration=31, var_wn=0.456279
fixed_point_iteration:Iteration=32, var_wn=0.451435
fixed_point_iteration:Iteration=33, var_wn=0.446882
fixed_point_iteration:Iteration=34, var_wn=0.442597
fixed_point_iteration:Iteration=35, var_wn=0.43856
fixed_point_iteration:Iteration=36, var_wn=0.434752
fixed_point_iteration:Iteration=37, var_wn=0.431155
fixed_point_iteration:Iteration=38, var_wn=0.427755
fixed_point_iteration:Iteration=39, var_wn=0.424537
fixed_point_iteration:Iteration=40, var_wn=0.42149
fixed_point_iteration:Iteration=41, var_wn=0.4186
fixed_point_iteration:Iteration=42, var_wn=0.415859
fixed_point_iteration:Iteration=43, var_wn=0.413256
fixed_point_iteration:Iteration=44, var_wn=0.410782
fixed_point_iteration:Iteration=45, var_wn=0.408429
fixed_point_iteration:Iteration=46, var_wn=0.406191
fixed_point_iteration:Iteration=47, var_wn=0.404059
fixed_point_iteration:Iteration=48, var_wn=0.402028
fixed_point_iteration:Iteration=49, var_wn=0.400092
fixed_point_iteration:Iteration=50, var_wn=0.398246
fixed_point_iteration:Iteration=51, var_wn=0.396483
fixed_point_iteration:Iteration=52, var_wn=0.3948
fixed_point_iteration:Iteration=53, var_wn=0.393193
fixed_point_iteration:Iteration=54, var_wn=0.391656
fixed_point_iteration:Iteration=55, var_wn=0.390187
fixed_point_iteration:Iteration=56, var_wn=0.388782
fixed_point_iteration:Iteration=57, var_wn=0.387438
fixed_point_iteration:Iteration=58, var_wn=0.386151
fixed_point_iteration:Iteration=59, var_wn=0.384918
fixed_point_iteration:Iteration=60, var_wn=0.383738
fixed_point_iteration:Iteration=61, var_wn=0.382606
fixed_point_iteration:Iteration=62, var_wn=0.381522
fixed_point_iteration:Iteration=63, var_wn=0.380482
fixed_point_iteration:Iteration=64, var_wn=0.379485
fixed_point_iteration:Iteration=65, var_wn=0.378528
fixed_point_iteration:Iteration=66, var_wn=0.37761
fixed_point_iteration:Iteration=67, var_wn=0.376728
fixed_point_iteration:Iteration=68, var_wn=0.375882
fixed_point_iteration:Iteration=69, var_wn=0.37507
fixed_point_iteration:Iteration=70, var_wn=0.374289
fixed_point_iteration:Iteration=71, var_wn=0.373539
fixed_point_iteration:Iteration=72, var_wn=0.372818
fixed_point_iteration:Iteration=73, var_wn=0.372126
fixed_point_iteration:Iteration=74, var_wn=0.37146
fixed_point_iteration:Iteration=75, var_wn=0.370819
fixed_point_iteration:Iteration=76, var_wn=0.370204
fixed_point_iteration:Iteration=77, var_wn=0.369611
fixed_point_iteration:Iteration=78, var_wn=0.369042
fixed_point_iteration:Iteration=79, var_wn=0.368493
fixed_point_iteration:Iteration=80, var_wn=0.367966
fixed_point_iteration:Iteration=81, var_wn=0.367458
fixed_point_iteration:Iteration=82, var_wn=0.366969
fixed_point_iteration:Iteration=83, var_wn=0.366499
fixed_point_iteration:Iteration=84, var_wn=0.366046
fixed_point_iteration:Iteration=85, var_wn=0.365609
fixed_point_iteration:Iteration=86, var_wn=0.365189
fixed_point_iteration:Iteration=87, var_wn=0.364785
fixed_point_iteration:Iteration=88, var_wn=0.364395
fixed_point_iteration:Iteration=89, var_wn=0.364019
fixed_point_iteration:Iteration=90, var_wn=0.363657
fixed_point_iteration:Iteration=91, var_wn=0.363309
fixed_point_iteration:Iteration=92, var_wn=0.362973
fixed_point_iteration:Iteration=93, var_wn=0.362649
fixed_point_iteration:Iteration=94, var_wn=0.362337
fixed_point_iteration:Iteration=95, var_wn=0.362036
fixed_point_iteration:Iteration=96, var_wn=0.361746
fixed_point_iteration:Iteration=97, var_wn=0.361466
fixed_point_iteration:Iteration=98, var_wn=0.361196
fixed_point_iteration:Iteration=99, var_wn=0.360936
fixed_point_iteration:Iteration=100, var_wn=0.360686
fixed_point_iteration:Iteration=101, var_wn=0.360444
fixed_point_iteration:Iteration=102, var_wn=0.360211
fixed_point_iteration:Iteration=103, var_wn=0.359986
fixed_point_iteration:Iteration=104, var_wn=0.359769
fixed_point_iteration:Iteration=105, var_wn=0.35956
fixed_point_iteration:Iteration=106, var_wn=0.359358
fixed_point_iteration:Iteration=107, var_wn=0.359163
fixed_point_iteration:Iteration=108, var_wn=0.358975
fixed_point_iteration:Iteration=109, var_wn=0.358794
fixed_point_iteration:Iteration=110, var_wn=0.358619
fixed_point_iteration:Iteration=111, var_wn=0.35845
fixed_point_iteration:Iteration=112, var_wn=0.358287
fixed_point_iteration:Iteration=113, var_wn=0.35813
fixed_point_iteration:Iteration=114, var_wn=0.357979
fixed_point_iteration:Iteration=115, var_wn=0.357832
fixed_point_iteration:Iteration=116, var_wn=0.357691
fixed_point_iteration:Iteration=117, var_wn=0.357555
fixed_point_iteration:Iteration=118, var_wn=0.357423
fixed_point_iteration:Iteration=119, var_wn=0.357296
fixed_point_iteration:Iteration=120, var_wn=0.357173
fixed_point_iteration:Iteration=121, var_wn=0.357055
fixed_point_iteration:Iteration=122, var_wn=0.356941
fixed_point_iteration:Iteration=123, var_wn=0.35683
fixed_point_iteration:Iteration=124, var_wn=0.356724
fixed_point_iteration:Iteration=125, var_wn=0.356621
fixed_point_iteration:Iteration=126, var_wn=0.356522
fixed_point_iteration:Iteration=127, var_wn=0.356426
fixed_point_iteration:Iteration=128, var_wn=0.356334
fixed_point_iteration:Iteration=129, var_wn=0.356244
fixed_point_iteration:Iteration=130, var_wn=0.356158
fixed_point_iteration:Iteration=131, var_wn=0.356075
fixed_point_iteration:Iteration=132, var_wn=0.355994
fixed_point_iteration:Iteration=133, var_wn=0.355917
fixed_point_iteration:Iteration=134, var_wn=0.355842
fixed_point_iteration:Iteration=135, var_wn=0.355769
fixed_point_iteration:Iteration=136, var_wn=0.355699
fixed_point_iteration:Iteration=137, var_wn=0.355632
fixed_point_iteration:Iteration=138, var_wn=0.355566
fixed_point_iteration:Iteration=139, var_wn=0.355504
fixed_point_iteration:Iteration=140, var_wn=0.355443
fixed_point_iteration:Iteration=141, var_wn=0.355384
fixed_point_iteration:Iteration=142, var_wn=0.355327
fixed_point_iteration:Iteration=143, var_wn=0.355272
fixed_point_iteration:Iteration=144, var_wn=0.35522
fixed_point_iteration:Iteration=145, var_wn=0.355168
fixed_point_iteration:Iteration=146, var_wn=0.355119
fixed_point_iteration:Iteration=147, var_wn=0.355071
fixed_point_iteration:Iteration=148, var_wn=0.355025
fixed_point_iteration:Iteration=149, var_wn=0.354981
fixed_point_iteration:Iteration=150, var_wn=0.354938
fixed_point_iteration:Iteration=151, var_wn=0.354896
fixed_point_iteration:Iteration=152, var_wn=0.354856
fixed_point_iteration:Iteration=153, var_wn=0.354818
fixed_point_iteration:Iteration=154, var_wn=0.35478
fixed_point_iteration:Iteration=155, var_wn=0.354744
fixed_point_iteration:Iteration=156, var_wn=0.354709
fixed_point_iteration:Iteration=157, var_wn=0.354676
fixed_point_iteration:Iteration=158, var_wn=0.354643
fixed_point_iteration:Iteration=159, var_wn=0.354612
fixed_point_iteration:Iteration=160, var_wn=0.354581
fixed_point_iteration:Iteration=161, var_wn=0.354552
fixed_point_iteration:Iteration=162, var_wn=0.354523
fixed_point_iteration:Iteration=163, var_wn=0.354496
fixed_point_iteration:Iteration=164, var_wn=0.35447
fixed_point_iteration:Iteration=165, var_wn=0.354444
fixed_point_iteration:Iteration=166, var_wn=0.354419
fixed_point_iteration:Iteration=167, var_wn=0.354396
fixed_point_iteration:Iteration=168, var_wn=0.354373
fixed_point_iteration:Iteration=169, var_wn=0.35435
fixed_point_iteration:Iteration=170, var_wn=0.354329
fixed_point_iteration:Iteration=171, var_wn=0.354308
fixed_point_iteration:Iteration=172, var_wn=0.354288
fixed_point_iteration:Iteration=173, var_wn=0.354269
fixed_point_iteration:Iteration=174, var_wn=0.35425
fixed_point_iteration:Iteration=175, var_wn=0.354232
fixed_point_iteration:Iteration=176, var_wn=0.354214
fixed_point_iteration:Iteration=177, var_wn=0.354197
fixed_point_iteration:Iteration=178, var_wn=0.354181
fixed_point_iteration:Iteration=179, var_wn=0.354165
fixed_point_iteration:Iteration=180, var_wn=0.35415
fixed_point_iteration:Iteration=181, var_wn=0.354135
fixed_point_iteration:Iteration=182, var_wn=0.354121
fixed_point_iteration:Iteration=183, var_wn=0.354107
fixed_point_iteration:Iteration=184, var_wn=0.354094
fixed_point_iteration:Iteration=185, var_wn=0.354081
fixed_point_iteration:Iteration=186, var_wn=0.354069
fixed_point_iteration:Iteration=187, var_wn=0.354057
fixed_point_iteration:Iteration=188, var_wn=0.354046
fixed_point_iteration:Iteration=189, var_wn=0.354034
fixed_point_iteration:Iteration=190, var_wn=0.354024
fixed_point_iteration:Iteration=191, var_wn=0.354013
fixed_point_iteration:Iteration=192, var_wn=0.354003
fixed_point_iteration:Iteration=193, var_wn=0.353993
WN variance = 0.353993
Partition size                 = (34,13,13)
Finished part [1/96]
Finished part [2/96]
Finished part [3/96]
Finished part [4/96]
Finished part [5/96]
Finished part [6/96]
Finished part [7/96]
Finished part [8/96]
Finished part [9/96]
Finished part [10/96]
Finished part [11/96]
Finished part [12/96]
Finished part [13/96]
Finished part [14/96]
Finished part [15/96]
Finished part [16/96]
Finished part [17/96]
Finished part [18/96]
Finished part [19/96]
Finished part [20/96]
Finished part [21/96]
Finished part [22/96]
Finished part [23/96]
Finished part [24/96]
Finished part [25/96]
Finished part [26/96]
Finished part [27/96]
Finished part [28/96]
Finished part [29/96]
Finished part [30/96]
Finished part [31/96]
Finished part [32/96]
Finished part [33/96]
Finished part [34/96]
Finished part [35/96]
Finished part [36/96]
Finished part [37/96]
Finished part [38/96]
Finished part [39/96]
Finished part [40/96]
Finished part [41/96]
Finished part [42/96]
Finished part [43/96]
Finished part [44/96]
Finished part [45/96]
Finished part [46/96]
Finished part [47/96]
Finished part [48/96]
Finished part [49/96]
Finished part [50/96]
Finished part [51/96]
Finished part [52/96]
Finished part [53/96]
Finished part [54/96]
Finished part [55/96]
Finished part [56/96]
Finished part [57/96]
Finished part [58/96]
Finished part [59/96]
Finished part [60/96]
Finished part [61/96]
Finished part [62/96]
Finished part [63/96]
Finished part [64/96]
Finished part [65/96]
Finished part [66/96]
Finished part [67/96]
Finished part [68/96]
Finished part [69/96]
Finished part [70/96]
Finished part [71/96]
Finished part [72/96]
Finished part [73/96]
Finished part [74/96]
Finished part [75/96]
Finished part [76/96]
Finished part [77/96]
Finished part [78/96]
Finished part [79/96]
Finished part [80/96]
Finished part [81/96]
Finished part [82/96]
Finished part [83/96]
Finished part [84/96]
Finished part [85/96]
Finished part [86/96]
Finished part [87/96]
Finished part [88/96]
Finished part [89/96]
Finished part [90/96]
Finished part [91/96]
Finished part [92/96]
Finished part [93/96]
Finished part [94/96]
Finished part [95/96]
Finished part [96/96]
Input file                     = /home/igankevich/workspace/arma-thesis/config/standing_wave.arma
Output grid size               = (200,40,40)
Output grid patch size         = (1,1,1)
Model                          = AR
Verification scheme            = manual
AR model                       = order=(7,7,7),acf.shape=(10,10,10)
ACF variance = 5
WN variance = 0.00259511
Partition size                 = (21,10,10)
Finished part [1/160]
Finished part [2/160]
Finished part [3/160]
Finished part [4/160]
Finished part [5/160]
Finished part [6/160]
Finished part [7/160]
Finished part [8/160]
Finished part [9/160]
Finished part [10/160]
Finished part [11/160]
Finished part [12/160]
Finished part [13/160]
Finished part [14/160]
Finished part [15/160]
Finished part [16/160]
Finished part [17/160]
Finished part [18/160]
Finished part [19/160]
Finished part [20/160]
Finished part [21/160]
Finished part [22/160]
Finished part [23/160]
Finished part [24/160]
Finished part [25/160]
Finished part [26/160]
Finished part [27/160]
Finished part [28/160]
Finished part [29/160]
Finished part [30/160]
Finished part [31/160]
Finished part [32/160]
Finished part [33/160]
Finished part [34/160]
Finished part [35/160]
Finished part [36/160]
Finished part [37/160]
Finished part [38/160]
Finished part [39/160]
Finished part [40/160]
Finished part [41/160]
Finished part [42/160]
Finished part [43/160]
Finished part [44/160]
Finished part [45/160]
Finished part [46/160]
Finished part [47/160]
Finished part [48/160]
Finished part [49/160]
Finished part [50/160]
Finished part [51/160]
Finished part [52/160]
Finished part [53/160]
Finished part [54/160]
Finished part [55/160]
Finished part [56/160]
Finished part [57/160]
Finished part [58/160]
Finished part [59/160]
Finished part [60/160]
Finished part [61/160]
Finished part [62/160]
Finished part [63/160]
Finished part [64/160]
Finished part [65/160]
Finished part [66/160]
Finished part [67/160]
Finished part [68/160]
Finished part [69/160]
Finished part [70/160]
Finished part [71/160]
Finished part [72/160]
Finished part [73/160]
Finished part [74/160]
Finished part [75/160]
Finished part [76/160]
Finished part [77/160]
Finished part [78/160]
Finished part [79/160]
Finished part [80/160]
Finished part [81/160]
Finished part [82/160]
Finished part [83/160]
Finished part [84/160]
Finished part [85/160]
Finished part [86/160]
Finished part [87/160]
Finished part [88/160]
Finished part [89/160]
Finished part [90/160]
Finished part [91/160]
Finished part [92/160]
Finished part [93/160]
Finished part [94/160]
Finished part [95/160]
Finished part [96/160]
Finished part [97/160]
Finished part [98/160]
Finished part [99/160]
Finished part [100/160]
Finished part [101/160]
Finished part [102/160]
Finished part [103/160]
Finished part [104/160]
Finished part [105/160]
Finished part [106/160]
Finished part [107/160]
Finished part [108/160]
Finished part [109/160]
Finished part [110/160]
Finished part [111/160]
Finished part [112/160]
Finished part [113/160]
Finished part [114/160]
Finished part [115/160]
Finished part [116/160]
Finished part [117/160]
Finished part [118/160]
Finished part [119/160]
Finished part [120/160]
Finished part [121/160]
Finished part [122/160]
Finished part [123/160]
Finished part [124/160]
Finished part [125/160]
Finished part [126/160]
Finished part [127/160]
Finished part [128/160]
Finished part [129/160]
Finished part [130/160]
Finished part [131/160]
Finished part [132/160]
Finished part [133/160]
Finished part [134/160]
Finished part [135/160]
Finished part [136/160]
Finished part [137/160]
Finished part [138/160]
Finished part [139/160]
Finished part [140/160]
Finished part [141/160]
Finished part [142/160]
Finished part [143/160]
Finished part [144/160]
Finished part [145/160]
Finished part [146/160]
Finished part [147/160]
Finished part [148/160]
Finished part [149/160]
Finished part [150/160]
Finished part [151/160]
Finished part [152/160]
Finished part [153/160]
Finished part [154/160]
Finished part [155/160]
Finished part [156/160]
Finished part [157/160]
Finished part [158/160]
Finished part [159/160]
Finished part [160/160]
Zeta size = (192,32,32)
Input file                     = /home/igankevich/workspace/arma-thesis/config/plain_wave_linear_solver.arma
Output grid size               = (200,128,40)
Output grid patch size         = (1,0.0629921,0.205128)
Model                          = plain_wave
Verification scheme            = manual
Plain wave model               = func=cos,amplitudes=[4],wavenumbers=[0.125],phases=[0],velocities=[0.5]
Velocity potential solver name = N4arma8velocity13Linear_solverIdEE
Velocity potential solver      = wnmax=(0,0.25),depth=12,domain=from (10,-12) to (10,4) npoints (1,128)
Input file                     = /home/igankevich/workspace/arma-thesis/config/plain_wave_high_amplitude_solver.arma
Output grid size               = (200,128,40)
Output grid patch size         = (1,0.0629921,0.205128)
Model                          = plain_wave
Verification scheme            = manual
Plain wave model               = func=cos,amplitudes=[4],wavenumbers=[0.125],phases=[0],velocities=[0.5]
Velocity potential solver name = N4arma8velocity21High_amplitude_solverIdEE
Velocity potential solver      = wnmax=(0,0.25),depth=12,domain=from (10,-12) to (10,4) npoints (1,128)
#+end_example
** Produce NIT plots
#+begin_src sh :exports none :results verbatim
root=$(pwd)

function generate_surface() {
  none=$1
  gcs=$2
  sn=$3
  testcase=$4

  wd=$root/build/$testcase
  rm -rf $wd
  mkdir -p $wd
  cd $wd
  cp $root/config/mt.dat .

  # run linear case
  arma -c $root/config/$none 2>&1
  cp -v zeta.csv zeta-none.csv

  # run Gram---Charlier case
  arma -c $root/config/$gcs 2>&1
  cp -v zeta.csv zeta-gramcharlier.csv

  # run skew normal case
  arma -c $root/config/$sn 2>&1
  cp -v zeta.csv zeta-skewnormal.csv
}

echo "NIT for propagating waves"
generate_surface \
  nit-propagating-none \
  nit-propagating-gramcharlier \
  nit-propagating-skewnormal \
  nit-propagating

echo "NIT for standing waves"
generate_surface \
  nit-standing-none \
  nit-standing-gramcharlier \
  nit-standing-skewnormal \
  nit-standing
#+end_src

#+RESULTS:
#+begin_example
NIT for propagating waves
Input file                     = /home/igankevich/workspace/arma-thesis/config/nit-propagating-none
Output grid size               = (200,40,40)
Output grid patch size         = (1,1,1)
Model                          = MA
Verification scheme            = manual
MA model                       = order=(20,10,10),acf.shape=(20,10,10),algorithm=fixed_point_iteration
Velocity potential solver name = N4arma8velocity21High_amplitude_solverIdEE
Velocity potential solver      = wnmax=from (0,0) to (0,0.25) npoints (2,2),depth=12,domain=from (10,-12) to (10,3) npoints (1,128)
NIT transform                  = none
ACF variance = 1
fixed_point_iteration:Iteration=0, var_wn=0.541662
fixed_point_iteration:Iteration=1, var_wn=0.387581
fixed_point_iteration:Iteration=2, var_wn=0.309602
fixed_point_iteration:Iteration=3, var_wn=0.262404
fixed_point_iteration:Iteration=4, var_wn=0.230656
fixed_point_iteration:Iteration=5, var_wn=0.207721
fixed_point_iteration:Iteration=6, var_wn=0.190288
fixed_point_iteration:Iteration=7, var_wn=0.176535
fixed_point_iteration:Iteration=8, var_wn=0.165376
fixed_point_iteration:Iteration=9, var_wn=0.156125
fixed_point_iteration:Iteration=10, var_wn=0.148322
fixed_point_iteration:Iteration=11, var_wn=0.141649
fixed_point_iteration:Iteration=12, var_wn=0.135875
fixed_point_iteration:Iteration=13, var_wn=0.130829
fixed_point_iteration:Iteration=14, var_wn=0.126382
fixed_point_iteration:Iteration=15, var_wn=0.122434
fixed_point_iteration:Iteration=16, var_wn=0.118905
fixed_point_iteration:Iteration=17, var_wn=0.115733
fixed_point_iteration:Iteration=18, var_wn=0.112867
fixed_point_iteration:Iteration=19, var_wn=0.110265
fixed_point_iteration:Iteration=20, var_wn=0.107894
fixed_point_iteration:Iteration=21, var_wn=0.105725
fixed_point_iteration:Iteration=22, var_wn=0.103733
fixed_point_iteration:Iteration=23, var_wn=0.101899
fixed_point_iteration:Iteration=24, var_wn=0.100206
fixed_point_iteration:Iteration=25, var_wn=0.0986382
fixed_point_iteration:Iteration=26, var_wn=0.0971831
fixed_point_iteration:Iteration=27, var_wn=0.0958297
fixed_point_iteration:Iteration=28, var_wn=0.0945682
fixed_point_iteration:Iteration=29, var_wn=0.0933903
fixed_point_iteration:Iteration=30, var_wn=0.0922883
fixed_point_iteration:Iteration=31, var_wn=0.0912558
fixed_point_iteration:Iteration=32, var_wn=0.0902869
fixed_point_iteration:Iteration=33, var_wn=0.0893763
fixed_point_iteration:Iteration=34, var_wn=0.0885194
fixed_point_iteration:Iteration=35, var_wn=0.087712
fixed_point_iteration:Iteration=36, var_wn=0.0869503
fixed_point_iteration:Iteration=37, var_wn=0.086231
fixed_point_iteration:Iteration=38, var_wn=0.085551
fixed_point_iteration:Iteration=39, var_wn=0.0849075
fixed_point_iteration:Iteration=40, var_wn=0.0842979
fixed_point_iteration:Iteration=41, var_wn=0.0837201
fixed_point_iteration:Iteration=42, var_wn=0.0831718
fixed_point_iteration:Iteration=43, var_wn=0.0826511
fixed_point_iteration:Iteration=44, var_wn=0.0821564
fixed_point_iteration:Iteration=45, var_wn=0.0816859
fixed_point_iteration:Iteration=46, var_wn=0.0812382
fixed_point_iteration:Iteration=47, var_wn=0.0808119
fixed_point_iteration:Iteration=48, var_wn=0.0804057
fixed_point_iteration:Iteration=49, var_wn=0.0800185
fixed_point_iteration:Iteration=50, var_wn=0.0796491
fixed_point_iteration:Iteration=51, var_wn=0.0792966
fixed_point_iteration:Iteration=52, var_wn=0.07896
fixed_point_iteration:Iteration=53, var_wn=0.0786385
fixed_point_iteration:Iteration=54, var_wn=0.0783313
fixed_point_iteration:Iteration=55, var_wn=0.0780375
fixed_point_iteration:Iteration=56, var_wn=0.0777565
fixed_point_iteration:Iteration=57, var_wn=0.0774875
fixed_point_iteration:Iteration=58, var_wn=0.0772301
fixed_point_iteration:Iteration=59, var_wn=0.0769836
fixed_point_iteration:Iteration=60, var_wn=0.0767475
fixed_point_iteration:Iteration=61, var_wn=0.0765213
fixed_point_iteration:Iteration=62, var_wn=0.0763044
fixed_point_iteration:Iteration=63, var_wn=0.0760964
fixed_point_iteration:Iteration=64, var_wn=0.0758969
fixed_point_iteration:Iteration=65, var_wn=0.0757056
fixed_point_iteration:Iteration=66, var_wn=0.075522
fixed_point_iteration:Iteration=67, var_wn=0.0753457
fixed_point_iteration:Iteration=68, var_wn=0.0751764
fixed_point_iteration:Iteration=69, var_wn=0.0750139
fixed_point_iteration:Iteration=70, var_wn=0.0748578
fixed_point_iteration:Iteration=71, var_wn=0.0747078
fixed_point_iteration:Iteration=72, var_wn=0.0745637
fixed_point_iteration:Iteration=73, var_wn=0.0744251
fixed_point_iteration:Iteration=74, var_wn=0.0742919
fixed_point_iteration:Iteration=75, var_wn=0.0741639
fixed_point_iteration:Iteration=76, var_wn=0.0740407
fixed_point_iteration:Iteration=77, var_wn=0.0739223
fixed_point_iteration:Iteration=78, var_wn=0.0738083
fixed_point_iteration:Iteration=79, var_wn=0.0736987
fixed_point_iteration:Iteration=80, var_wn=0.0735932
fixed_point_iteration:Iteration=81, var_wn=0.0734916
fixed_point_iteration:Iteration=82, var_wn=0.0733939
fixed_point_iteration:Iteration=83, var_wn=0.0732998
fixed_point_iteration:Iteration=84, var_wn=0.0732091
fixed_point_iteration:Iteration=85, var_wn=0.0731219
fixed_point_iteration:Iteration=86, var_wn=0.0730379
fixed_point_iteration:Iteration=87, var_wn=0.0729569
fixed_point_iteration:Iteration=88, var_wn=0.072879
fixed_point_iteration:Iteration=89, var_wn=0.0728038
fixed_point_iteration:Iteration=90, var_wn=0.0727315
fixed_point_iteration:Iteration=91, var_wn=0.0726617
fixed_point_iteration:Iteration=92, var_wn=0.0725945
fixed_point_iteration:Iteration=93, var_wn=0.0725298
fixed_point_iteration:Iteration=94, var_wn=0.0724673
fixed_point_iteration:Iteration=95, var_wn=0.0724072
fixed_point_iteration:Iteration=96, var_wn=0.0723491
fixed_point_iteration:Iteration=97, var_wn=0.0722932
fixed_point_iteration:Iteration=98, var_wn=0.0722393
fixed_point_iteration:Iteration=99, var_wn=0.0721873
fixed_point_iteration:Iteration=100, var_wn=0.0721372
fixed_point_iteration:Iteration=101, var_wn=0.0720888
fixed_point_iteration:Iteration=102, var_wn=0.0720422
fixed_point_iteration:Iteration=103, var_wn=0.0719972
fixed_point_iteration:Iteration=104, var_wn=0.0719538
fixed_point_iteration:Iteration=105, var_wn=0.0719119
fixed_point_iteration:Iteration=106, var_wn=0.0718716
fixed_point_iteration:Iteration=107, var_wn=0.0718326
fixed_point_iteration:Iteration=108, var_wn=0.0717951
fixed_point_iteration:Iteration=109, var_wn=0.0717588
fixed_point_iteration:Iteration=110, var_wn=0.0717238
fixed_point_iteration:Iteration=111, var_wn=0.0716901
fixed_point_iteration:Iteration=112, var_wn=0.0716575
fixed_point_iteration:Iteration=113, var_wn=0.0716261
fixed_point_iteration:Iteration=114, var_wn=0.0715957
fixed_point_iteration:Iteration=115, var_wn=0.0715664
fixed_point_iteration:Iteration=116, var_wn=0.0715382
fixed_point_iteration:Iteration=117, var_wn=0.0715109
fixed_point_iteration:Iteration=118, var_wn=0.0714846
fixed_point_iteration:Iteration=119, var_wn=0.0714592
fixed_point_iteration:Iteration=120, var_wn=0.0714347
fixed_point_iteration:Iteration=121, var_wn=0.071411
fixed_point_iteration:Iteration=122, var_wn=0.0713881
fixed_point_iteration:Iteration=123, var_wn=0.0713661
fixed_point_iteration:Iteration=124, var_wn=0.0713448
fixed_point_iteration:Iteration=125, var_wn=0.0713242
fixed_point_iteration:Iteration=126, var_wn=0.0713044
fixed_point_iteration:Iteration=127, var_wn=0.0712852
fixed_point_iteration:Iteration=128, var_wn=0.0712667
fixed_point_iteration:Iteration=129, var_wn=0.0712488
fixed_point_iteration:Iteration=130, var_wn=0.0712316
fixed_point_iteration:Iteration=131, var_wn=0.0712149
fixed_point_iteration:Iteration=132, var_wn=0.0711988
fixed_point_iteration:Iteration=133, var_wn=0.0711833
fixed_point_iteration:Iteration=134, var_wn=0.0711683
fixed_point_iteration:Iteration=135, var_wn=0.0711538
fixed_point_iteration:Iteration=136, var_wn=0.0711398
fixed_point_iteration:Iteration=137, var_wn=0.0711263
fixed_point_iteration:Iteration=138, var_wn=0.0711133
fixed_point_iteration:Iteration=139, var_wn=0.0711007
fixed_point_iteration:Iteration=140, var_wn=0.0710885
fixed_point_iteration:Iteration=141, var_wn=0.0710768
fixed_point_iteration:Iteration=142, var_wn=0.0710654
fixed_point_iteration:Iteration=143, var_wn=0.0710545
fixed_point_iteration:Iteration=144, var_wn=0.0710439
fixed_point_iteration:Iteration=145, var_wn=0.0710337
fixed_point_iteration:Iteration=146, var_wn=0.0710238
WN variance = 0.0710238
Partition size                 = (34,13,13)
Finished part [1/96]Finished part [2/96]Finished part [3/96]Finished part [4/96]Finished part [5/96]Finished part [6/96]Finished part [7/96]Finished part [8/96]Finished part [9/96]Finished part [10/96]Finished part [11/96]Finished part [12/96]Finished part [13/96]Finished part [14/96]Finished part [15/96]Finished part [16/96]Finished part [17/96]Finished part [18/96]Finished part [19/96]Finished part [20/96]Finished part [21/96]Finished part [22/96]Finished part [23/96]Finished part [24/96]Finished part [25/96]Finished part [26/96]Finished part [27/96]Finished part [28/96]Finished part [29/96]Finished part [30/96]Finished part [31/96]Finished part [32/96]Finished part [33/96]Finished part [34/96]Finished part [35/96]Finished part [36/96]Finished part [37/96]Finished part [38/96]Finished part [39/96]Finished part [40/96]Finished part [41/96]Finished part [42/96]Finished part [43/96]Finished part [44/96]Finished part [45/96]Finished part [46/96]Finished part [47/96]Finished part [48/96]Finished part [49/96]Finished part [50/96]Finished part [51/96]Finished part [52/96]Finished part [53/96]Finished part [54/96]Finished part [55/96]Finished part [56/96]Finished part [57/96]Finished part [58/96]Finished part [59/96]Finished part [60/96]Finished part [61/96]Finished part [62/96]Finished part [63/96]Finished part [64/96]Finished part [65/96]Finished part [66/96]Finished part [67/96]Finished part [68/96]Finished part [69/96]Finished part [70/96]Finished part [71/96]Finished part [72/96]Finished part [73/96]Finished part [74/96]Finished part [75/96]Finished part [76/96]Finished part [77/96]Finished part [78/96]Finished part [79/96]Finished part [80/96]Finished part [81/96]Finished part [82/96]Finished part [83/96]Finished part [84/96]Finished part [85/96]Finished part [86/96]Finished part [87/96]Finished part [88/96]Finished part [89/96]Finished part [90/96]Finished part [91/96]Finished part [92/96]Finished part [93/96]Finished part [94/96]Finished part [95/96]Finished part [96/96]
'zeta.csv' -> 'zeta-none.csv'
Input file                     = /home/igankevich/workspace/arma-thesis/config/nit-propagating-gramcharlier
Output grid size               = (200,40,40)
Output grid patch size         = (1,1,1)
Model                          = MA
Verification scheme            = manual
MA model                       = order=(20,10,10),acf.shape=(20,10,10),algorithm=fixed_point_iteration
Velocity potential solver name = N4arma8velocity21High_amplitude_solverIdEE
Velocity potential solver      = wnmax=from (0,0) to (0,0.25) npoints (2,2),depth=12,domain=from (10,-12) to (10,3) npoints (1,128)
NIT transform                  = dist=gram_charlier,skewness=2.25,kurtosis=0.4,interpolation_nodes=100,interpolation_order=12,gram_charlier_order=20
err = 0.999006
err = 0.171001
err = 0.25565
err = 0.275353
err = 6.34477e+26
err = 7.61373e+26
err = 4.86898e+32
err = 4.86898e+32
err = 7.03444e+34
err = 7.03444e+34
err = 7.03444e+34
err = 7.03444e+34
err = 7.03444e+34
err = 7.03444e+34
err = 7.03444e+34
err = 7.03447e+34
err = 7.03447e+34
err = 7.03807e+34
err = 7.03808e+34
err = 7.26744e+34
trim = 2
ACF variance = 1
fixed_point_iteration:Iteration=0, var_wn=0.541662
fixed_point_iteration:Iteration=1, var_wn=0.387581
fixed_point_iteration:Iteration=2, var_wn=0.309602
fixed_point_iteration:Iteration=3, var_wn=0.262404
fixed_point_iteration:Iteration=4, var_wn=0.230656
fixed_point_iteration:Iteration=5, var_wn=0.207721
fixed_point_iteration:Iteration=6, var_wn=0.190288
fixed_point_iteration:Iteration=7, var_wn=0.176535
fixed_point_iteration:Iteration=8, var_wn=0.165376
fixed_point_iteration:Iteration=9, var_wn=0.156125
fixed_point_iteration:Iteration=10, var_wn=0.148322
fixed_point_iteration:Iteration=11, var_wn=0.141649
fixed_point_iteration:Iteration=12, var_wn=0.135875
fixed_point_iteration:Iteration=13, var_wn=0.130829
fixed_point_iteration:Iteration=14, var_wn=0.126382
fixed_point_iteration:Iteration=15, var_wn=0.122434
fixed_point_iteration:Iteration=16, var_wn=0.118905
fixed_point_iteration:Iteration=17, var_wn=0.115733
fixed_point_iteration:Iteration=18, var_wn=0.112867
fixed_point_iteration:Iteration=19, var_wn=0.110265
fixed_point_iteration:Iteration=20, var_wn=0.107894
fixed_point_iteration:Iteration=21, var_wn=0.105725
fixed_point_iteration:Iteration=22, var_wn=0.103733
fixed_point_iteration:Iteration=23, var_wn=0.101899
fixed_point_iteration:Iteration=24, var_wn=0.100206
fixed_point_iteration:Iteration=25, var_wn=0.0986382
fixed_point_iteration:Iteration=26, var_wn=0.0971831
fixed_point_iteration:Iteration=27, var_wn=0.0958297
fixed_point_iteration:Iteration=28, var_wn=0.0945682
fixed_point_iteration:Iteration=29, var_wn=0.0933903
fixed_point_iteration:Iteration=30, var_wn=0.0922883
fixed_point_iteration:Iteration=31, var_wn=0.0912558
fixed_point_iteration:Iteration=32, var_wn=0.0902869
fixed_point_iteration:Iteration=33, var_wn=0.0893763
fixed_point_iteration:Iteration=34, var_wn=0.0885194
fixed_point_iteration:Iteration=35, var_wn=0.087712
fixed_point_iteration:Iteration=36, var_wn=0.0869503
fixed_point_iteration:Iteration=37, var_wn=0.086231
fixed_point_iteration:Iteration=38, var_wn=0.085551
fixed_point_iteration:Iteration=39, var_wn=0.0849075
fixed_point_iteration:Iteration=40, var_wn=0.0842979
fixed_point_iteration:Iteration=41, var_wn=0.0837201
fixed_point_iteration:Iteration=42, var_wn=0.0831718
fixed_point_iteration:Iteration=43, var_wn=0.0826511
fixed_point_iteration:Iteration=44, var_wn=0.0821564
fixed_point_iteration:Iteration=45, var_wn=0.0816859
fixed_point_iteration:Iteration=46, var_wn=0.0812382
fixed_point_iteration:Iteration=47, var_wn=0.0808119
fixed_point_iteration:Iteration=48, var_wn=0.0804057
fixed_point_iteration:Iteration=49, var_wn=0.0800185
fixed_point_iteration:Iteration=50, var_wn=0.0796491
fixed_point_iteration:Iteration=51, var_wn=0.0792966
fixed_point_iteration:Iteration=52, var_wn=0.07896
fixed_point_iteration:Iteration=53, var_wn=0.0786385
fixed_point_iteration:Iteration=54, var_wn=0.0783313
fixed_point_iteration:Iteration=55, var_wn=0.0780375
fixed_point_iteration:Iteration=56, var_wn=0.0777565
fixed_point_iteration:Iteration=57, var_wn=0.0774875
fixed_point_iteration:Iteration=58, var_wn=0.0772301
fixed_point_iteration:Iteration=59, var_wn=0.0769836
fixed_point_iteration:Iteration=60, var_wn=0.0767475
fixed_point_iteration:Iteration=61, var_wn=0.0765213
fixed_point_iteration:Iteration=62, var_wn=0.0763044
fixed_point_iteration:Iteration=63, var_wn=0.0760964
fixed_point_iteration:Iteration=64, var_wn=0.0758969
fixed_point_iteration:Iteration=65, var_wn=0.0757056
fixed_point_iteration:Iteration=66, var_wn=0.075522
fixed_point_iteration:Iteration=67, var_wn=0.0753457
fixed_point_iteration:Iteration=68, var_wn=0.0751764
fixed_point_iteration:Iteration=69, var_wn=0.0750139
fixed_point_iteration:Iteration=70, var_wn=0.0748578
fixed_point_iteration:Iteration=71, var_wn=0.0747078
fixed_point_iteration:Iteration=72, var_wn=0.0745637
fixed_point_iteration:Iteration=73, var_wn=0.0744251
fixed_point_iteration:Iteration=74, var_wn=0.0742919
fixed_point_iteration:Iteration=75, var_wn=0.0741639
fixed_point_iteration:Iteration=76, var_wn=0.0740407
fixed_point_iteration:Iteration=77, var_wn=0.0739223
fixed_point_iteration:Iteration=78, var_wn=0.0738083
fixed_point_iteration:Iteration=79, var_wn=0.0736987
fixed_point_iteration:Iteration=80, var_wn=0.0735932
fixed_point_iteration:Iteration=81, var_wn=0.0734916
fixed_point_iteration:Iteration=82, var_wn=0.0733939
fixed_point_iteration:Iteration=83, var_wn=0.0732998
fixed_point_iteration:Iteration=84, var_wn=0.0732091
fixed_point_iteration:Iteration=85, var_wn=0.0731219
fixed_point_iteration:Iteration=86, var_wn=0.0730379
fixed_point_iteration:Iteration=87, var_wn=0.0729569
fixed_point_iteration:Iteration=88, var_wn=0.072879
fixed_point_iteration:Iteration=89, var_wn=0.0728038
fixed_point_iteration:Iteration=90, var_wn=0.0727315
fixed_point_iteration:Iteration=91, var_wn=0.0726617
fixed_point_iteration:Iteration=92, var_wn=0.0725945
fixed_point_iteration:Iteration=93, var_wn=0.0725298
fixed_point_iteration:Iteration=94, var_wn=0.0724673
fixed_point_iteration:Iteration=95, var_wn=0.0724072
fixed_point_iteration:Iteration=96, var_wn=0.0723491
fixed_point_iteration:Iteration=97, var_wn=0.0722932
fixed_point_iteration:Iteration=98, var_wn=0.0722393
fixed_point_iteration:Iteration=99, var_wn=0.0721873
fixed_point_iteration:Iteration=100, var_wn=0.0721372
fixed_point_iteration:Iteration=101, var_wn=0.0720888
fixed_point_iteration:Iteration=102, var_wn=0.0720422
fixed_point_iteration:Iteration=103, var_wn=0.0719972
fixed_point_iteration:Iteration=104, var_wn=0.0719538
fixed_point_iteration:Iteration=105, var_wn=0.0719119
fixed_point_iteration:Iteration=106, var_wn=0.0718716
fixed_point_iteration:Iteration=107, var_wn=0.0718326
fixed_point_iteration:Iteration=108, var_wn=0.0717951
fixed_point_iteration:Iteration=109, var_wn=0.0717588
fixed_point_iteration:Iteration=110, var_wn=0.0717238
fixed_point_iteration:Iteration=111, var_wn=0.0716901
fixed_point_iteration:Iteration=112, var_wn=0.0716575
fixed_point_iteration:Iteration=113, var_wn=0.0716261
fixed_point_iteration:Iteration=114, var_wn=0.0715957
fixed_point_iteration:Iteration=115, var_wn=0.0715664
fixed_point_iteration:Iteration=116, var_wn=0.0715382
fixed_point_iteration:Iteration=117, var_wn=0.0715109
fixed_point_iteration:Iteration=118, var_wn=0.0714846
fixed_point_iteration:Iteration=119, var_wn=0.0714592
fixed_point_iteration:Iteration=120, var_wn=0.0714347
fixed_point_iteration:Iteration=121, var_wn=0.071411
fixed_point_iteration:Iteration=122, var_wn=0.0713881
fixed_point_iteration:Iteration=123, var_wn=0.0713661
fixed_point_iteration:Iteration=124, var_wn=0.0713448
fixed_point_iteration:Iteration=125, var_wn=0.0713242
fixed_point_iteration:Iteration=126, var_wn=0.0713044
fixed_point_iteration:Iteration=127, var_wn=0.0712852
fixed_point_iteration:Iteration=128, var_wn=0.0712667
fixed_point_iteration:Iteration=129, var_wn=0.0712488
fixed_point_iteration:Iteration=130, var_wn=0.0712316
fixed_point_iteration:Iteration=131, var_wn=0.0712149
fixed_point_iteration:Iteration=132, var_wn=0.0711988
fixed_point_iteration:Iteration=133, var_wn=0.0711833
fixed_point_iteration:Iteration=134, var_wn=0.0711683
fixed_point_iteration:Iteration=135, var_wn=0.0711538
fixed_point_iteration:Iteration=136, var_wn=0.0711398
fixed_point_iteration:Iteration=137, var_wn=0.0711263
fixed_point_iteration:Iteration=138, var_wn=0.0711133
fixed_point_iteration:Iteration=139, var_wn=0.0711007
fixed_point_iteration:Iteration=140, var_wn=0.0710885
fixed_point_iteration:Iteration=141, var_wn=0.0710768
fixed_point_iteration:Iteration=142, var_wn=0.0710654
fixed_point_iteration:Iteration=143, var_wn=0.0710545
fixed_point_iteration:Iteration=144, var_wn=0.0710439
fixed_point_iteration:Iteration=145, var_wn=0.0710337
fixed_point_iteration:Iteration=146, var_wn=0.0710238
WN variance = 0.0710238
Partition size                 = (34,13,13)
Finished part [1/96]Finished part [2/96]Finished part [3/96]Finished part [4/96]Finished part [5/96]Finished part [6/96]Finished part [7/96]Finished part [8/96]Finished part [9/96]Finished part [10/96]Finished part [11/96]Finished part [12/96]Finished part [13/96]Finished part [14/96]Finished part [15/96]Finished part [16/96]Finished part [17/96]Finished part [18/96]Finished part [19/96]Finished part [20/96]Finished part [21/96]Finished part [22/96]Finished part [23/96]Finished part [24/96]Finished part [25/96]Finished part [26/96]Finished part [27/96]Finished part [28/96]Finished part [29/96]Finished part [30/96]Finished part [31/96]Finished part [32/96]Finished part [33/96]Finished part [34/96]Finished part [35/96]Finished part [36/96]Finished part [37/96]Finished part [38/96]Finished part [39/96]Finished part [40/96]Finished part [41/96]Finished part [42/96]Finished part [43/96]Finished part [44/96]Finished part [45/96]Finished part [46/96]Finished part [47/96]Finished part [48/96]Finished part [49/96]Finished part [50/96]Finished part [51/96]Finished part [52/96]Finished part [53/96]Finished part [54/96]Finished part [55/96]Finished part [56/96]Finished part [57/96]Finished part [58/96]Finished part [59/96]Finished part [60/96]Finished part [61/96]Finished part [62/96]Finished part [63/96]Finished part [64/96]Finished part [65/96]Finished part [66/96]Finished part [67/96]Finished part [68/96]Finished part [69/96]Finished part [70/96]Finished part [71/96]Finished part [72/96]Finished part [73/96]Finished part [74/96]Finished part [75/96]Finished part [76/96]Finished part [77/96]Finished part [78/96]Finished part [79/96]Finished part [80/96]Finished part [81/96]Finished part [82/96]Finished part [83/96]Finished part [84/96]Finished part [85/96]Finished part [86/96]Finished part [87/96]Finished part [88/96]Finished part [89/96]Finished part [90/96]Finished part [91/96]Finished part [92/96]Finished part [93/96]Finished part [94/96]Finished part [95/96]Finished part [96/96]
'zeta.csv' -> 'zeta-gramcharlier.csv'
Input file                     = /home/igankevich/workspace/arma-thesis/config/nit-propagating-skewnormal
Output grid size               = (200,40,40)
Output grid patch size         = (1,1,1)
Model                          = MA
Verification scheme            = manual
MA model                       = order=(20,10,10),acf.shape=(20,10,10),algorithm=fixed_point_iteration
Velocity potential solver name = N4arma8velocity21High_amplitude_solverIdEE
Velocity potential solver      = wnmax=from (0,0) to (0,0.25) npoints (2,2),depth=12,domain=from (10,-12) to (10,3) npoints (1,128)
NIT transform                  = dist=skew_normal,mean=0,stdev=1,alpha=1,interpolation_nodes=100,interpolation_order=12,gram_charlier_order=20
err = inf
err = inf
err = inf
err = inf
err = inf
err = inf
err = inf
err = inf
err = inf
err = inf
err = inf
err = inf
err = inf
err = inf
err = inf
err = inf
err = inf
err = inf
err = inf
err = inf
trim = 0
ACF variance = 1
fixed_point_iteration:Iteration=0, var_wn=0.541662
fixed_point_iteration:Iteration=1, var_wn=0.387581
fixed_point_iteration:Iteration=2, var_wn=0.309602
fixed_point_iteration:Iteration=3, var_wn=0.262404
fixed_point_iteration:Iteration=4, var_wn=0.230656
fixed_point_iteration:Iteration=5, var_wn=0.207721
fixed_point_iteration:Iteration=6, var_wn=0.190288
fixed_point_iteration:Iteration=7, var_wn=0.176535
fixed_point_iteration:Iteration=8, var_wn=0.165376
fixed_point_iteration:Iteration=9, var_wn=0.156125
fixed_point_iteration:Iteration=10, var_wn=0.148322
fixed_point_iteration:Iteration=11, var_wn=0.141649
fixed_point_iteration:Iteration=12, var_wn=0.135875
fixed_point_iteration:Iteration=13, var_wn=0.130829
fixed_point_iteration:Iteration=14, var_wn=0.126382
fixed_point_iteration:Iteration=15, var_wn=0.122434
fixed_point_iteration:Iteration=16, var_wn=0.118905
fixed_point_iteration:Iteration=17, var_wn=0.115733
fixed_point_iteration:Iteration=18, var_wn=0.112867
fixed_point_iteration:Iteration=19, var_wn=0.110265
fixed_point_iteration:Iteration=20, var_wn=0.107894
fixed_point_iteration:Iteration=21, var_wn=0.105725
fixed_point_iteration:Iteration=22, var_wn=0.103733
fixed_point_iteration:Iteration=23, var_wn=0.101899
fixed_point_iteration:Iteration=24, var_wn=0.100206
fixed_point_iteration:Iteration=25, var_wn=0.0986382
fixed_point_iteration:Iteration=26, var_wn=0.0971831
fixed_point_iteration:Iteration=27, var_wn=0.0958297
fixed_point_iteration:Iteration=28, var_wn=0.0945682
fixed_point_iteration:Iteration=29, var_wn=0.0933903
fixed_point_iteration:Iteration=30, var_wn=0.0922883
fixed_point_iteration:Iteration=31, var_wn=0.0912558
fixed_point_iteration:Iteration=32, var_wn=0.0902869
fixed_point_iteration:Iteration=33, var_wn=0.0893763
fixed_point_iteration:Iteration=34, var_wn=0.0885194
fixed_point_iteration:Iteration=35, var_wn=0.087712
fixed_point_iteration:Iteration=36, var_wn=0.0869503
fixed_point_iteration:Iteration=37, var_wn=0.086231
fixed_point_iteration:Iteration=38, var_wn=0.085551
fixed_point_iteration:Iteration=39, var_wn=0.0849075
fixed_point_iteration:Iteration=40, var_wn=0.0842979
fixed_point_iteration:Iteration=41, var_wn=0.0837201
fixed_point_iteration:Iteration=42, var_wn=0.0831718
fixed_point_iteration:Iteration=43, var_wn=0.0826511
fixed_point_iteration:Iteration=44, var_wn=0.0821564
fixed_point_iteration:Iteration=45, var_wn=0.0816859
fixed_point_iteration:Iteration=46, var_wn=0.0812382
fixed_point_iteration:Iteration=47, var_wn=0.0808119
fixed_point_iteration:Iteration=48, var_wn=0.0804057
fixed_point_iteration:Iteration=49, var_wn=0.0800185
fixed_point_iteration:Iteration=50, var_wn=0.0796491
fixed_point_iteration:Iteration=51, var_wn=0.0792966
fixed_point_iteration:Iteration=52, var_wn=0.07896
fixed_point_iteration:Iteration=53, var_wn=0.0786385
fixed_point_iteration:Iteration=54, var_wn=0.0783313
fixed_point_iteration:Iteration=55, var_wn=0.0780375
fixed_point_iteration:Iteration=56, var_wn=0.0777565
fixed_point_iteration:Iteration=57, var_wn=0.0774875
fixed_point_iteration:Iteration=58, var_wn=0.0772301
fixed_point_iteration:Iteration=59, var_wn=0.0769836
fixed_point_iteration:Iteration=60, var_wn=0.0767475
fixed_point_iteration:Iteration=61, var_wn=0.0765213
fixed_point_iteration:Iteration=62, var_wn=0.0763044
fixed_point_iteration:Iteration=63, var_wn=0.0760964
fixed_point_iteration:Iteration=64, var_wn=0.0758969
fixed_point_iteration:Iteration=65, var_wn=0.0757056
fixed_point_iteration:Iteration=66, var_wn=0.075522
fixed_point_iteration:Iteration=67, var_wn=0.0753457
fixed_point_iteration:Iteration=68, var_wn=0.0751764
fixed_point_iteration:Iteration=69, var_wn=0.0750139
fixed_point_iteration:Iteration=70, var_wn=0.0748578
fixed_point_iteration:Iteration=71, var_wn=0.0747078
fixed_point_iteration:Iteration=72, var_wn=0.0745637
fixed_point_iteration:Iteration=73, var_wn=0.0744251
fixed_point_iteration:Iteration=74, var_wn=0.0742919
fixed_point_iteration:Iteration=75, var_wn=0.0741639
fixed_point_iteration:Iteration=76, var_wn=0.0740407
fixed_point_iteration:Iteration=77, var_wn=0.0739223
fixed_point_iteration:Iteration=78, var_wn=0.0738083
fixed_point_iteration:Iteration=79, var_wn=0.0736987
fixed_point_iteration:Iteration=80, var_wn=0.0735932
fixed_point_iteration:Iteration=81, var_wn=0.0734916
fixed_point_iteration:Iteration=82, var_wn=0.0733939
fixed_point_iteration:Iteration=83, var_wn=0.0732998
fixed_point_iteration:Iteration=84, var_wn=0.0732091
fixed_point_iteration:Iteration=85, var_wn=0.0731219
fixed_point_iteration:Iteration=86, var_wn=0.0730379
fixed_point_iteration:Iteration=87, var_wn=0.0729569
fixed_point_iteration:Iteration=88, var_wn=0.072879
fixed_point_iteration:Iteration=89, var_wn=0.0728038
fixed_point_iteration:Iteration=90, var_wn=0.0727315
fixed_point_iteration:Iteration=91, var_wn=0.0726617
fixed_point_iteration:Iteration=92, var_wn=0.0725945
fixed_point_iteration:Iteration=93, var_wn=0.0725298
fixed_point_iteration:Iteration=94, var_wn=0.0724673
fixed_point_iteration:Iteration=95, var_wn=0.0724072
fixed_point_iteration:Iteration=96, var_wn=0.0723491
fixed_point_iteration:Iteration=97, var_wn=0.0722932
fixed_point_iteration:Iteration=98, var_wn=0.0722393
fixed_point_iteration:Iteration=99, var_wn=0.0721873
fixed_point_iteration:Iteration=100, var_wn=0.0721372
fixed_point_iteration:Iteration=101, var_wn=0.0720888
fixed_point_iteration:Iteration=102, var_wn=0.0720422
fixed_point_iteration:Iteration=103, var_wn=0.0719972
fixed_point_iteration:Iteration=104, var_wn=0.0719538
fixed_point_iteration:Iteration=105, var_wn=0.0719119
fixed_point_iteration:Iteration=106, var_wn=0.0718716
fixed_point_iteration:Iteration=107, var_wn=0.0718326
fixed_point_iteration:Iteration=108, var_wn=0.0717951
fixed_point_iteration:Iteration=109, var_wn=0.0717588
fixed_point_iteration:Iteration=110, var_wn=0.0717238
fixed_point_iteration:Iteration=111, var_wn=0.0716901
fixed_point_iteration:Iteration=112, var_wn=0.0716575
fixed_point_iteration:Iteration=113, var_wn=0.0716261
fixed_point_iteration:Iteration=114, var_wn=0.0715957
fixed_point_iteration:Iteration=115, var_wn=0.0715664
fixed_point_iteration:Iteration=116, var_wn=0.0715382
fixed_point_iteration:Iteration=117, var_wn=0.0715109
fixed_point_iteration:Iteration=118, var_wn=0.0714846
fixed_point_iteration:Iteration=119, var_wn=0.0714592
fixed_point_iteration:Iteration=120, var_wn=0.0714347
fixed_point_iteration:Iteration=121, var_wn=0.071411
fixed_point_iteration:Iteration=122, var_wn=0.0713881
fixed_point_iteration:Iteration=123, var_wn=0.0713661
fixed_point_iteration:Iteration=124, var_wn=0.0713448
fixed_point_iteration:Iteration=125, var_wn=0.0713242
fixed_point_iteration:Iteration=126, var_wn=0.0713044
fixed_point_iteration:Iteration=127, var_wn=0.0712852
fixed_point_iteration:Iteration=128, var_wn=0.0712667
fixed_point_iteration:Iteration=129, var_wn=0.0712488
fixed_point_iteration:Iteration=130, var_wn=0.0712316
fixed_point_iteration:Iteration=131, var_wn=0.0712149
fixed_point_iteration:Iteration=132, var_wn=0.0711988
fixed_point_iteration:Iteration=133, var_wn=0.0711833
fixed_point_iteration:Iteration=134, var_wn=0.0711683
fixed_point_iteration:Iteration=135, var_wn=0.0711538
fixed_point_iteration:Iteration=136, var_wn=0.0711398
fixed_point_iteration:Iteration=137, var_wn=0.0711263
fixed_point_iteration:Iteration=138, var_wn=0.0711133
fixed_point_iteration:Iteration=139, var_wn=0.0711007
fixed_point_iteration:Iteration=140, var_wn=0.0710885
fixed_point_iteration:Iteration=141, var_wn=0.0710768
fixed_point_iteration:Iteration=142, var_wn=0.0710654
fixed_point_iteration:Iteration=143, var_wn=0.0710545
fixed_point_iteration:Iteration=144, var_wn=0.0710439
fixed_point_iteration:Iteration=145, var_wn=0.0710337
fixed_point_iteration:Iteration=146, var_wn=0.0710238
WN variance = 0.0710238
Partition size                 = (34,13,13)
Finished part [1/96]Finished part [2/96]Finished part [3/96]Finished part [4/96]Finished part [5/96]Finished part [6/96]Finished part [7/96]Finished part [8/96]Finished part [9/96]Finished part [10/96]Finished part [11/96]Finished part [12/96]Finished part [13/96]Finished part [14/96]Finished part [15/96]Finished part [16/96]Finished part [17/96]Finished part [18/96]Finished part [19/96]Finished part [20/96]Finished part [21/96]Finished part [22/96]Finished part [23/96]Finished part [24/96]Finished part [25/96]Finished part [26/96]Finished part [27/96]Finished part [28/96]Finished part [29/96]Finished part [30/96]Finished part [31/96]Finished part [32/96]Finished part [33/96]Finished part [34/96]Finished part [35/96]Finished part [36/96]Finished part [37/96]Finished part [38/96]Finished part [39/96]Finished part [40/96]Finished part [41/96]Finished part [42/96]Finished part [43/96]Finished part [44/96]Finished part [45/96]Finished part [46/96]Finished part [47/96]Finished part [48/96]Finished part [49/96]Finished part [50/96]Finished part [51/96]Finished part [52/96]Finished part [53/96]Finished part [54/96]Finished part [55/96]Finished part [56/96]Finished part [57/96]Finished part [58/96]Finished part [59/96]Finished part [60/96]Finished part [61/96]Finished part [62/96]Finished part [63/96]Finished part [64/96]Finished part [65/96]Finished part [66/96]Finished part [67/96]Finished part [68/96]Finished part [69/96]Finished part [70/96]Finished part [71/96]Finished part [72/96]Finished part [73/96]Finished part [74/96]Finished part [75/96]Finished part [76/96]Finished part [77/96]Finished part [78/96]Finished part [79/96]Finished part [80/96]Finished part [81/96]Finished part [82/96]Finished part [83/96]Finished part [84/96]Finished part [85/96]Finished part [86/96]Finished part [87/96]Finished part [88/96]Finished part [89/96]Finished part [90/96]Finished part [91/96]Finished part [92/96]Finished part [93/96]Finished part [94/96]Finished part [95/96]Finished part [96/96]
'zeta.csv' -> 'zeta-skewnormal.csv'
NIT for standing waves
Input file                     = /home/igankevich/workspace/arma-thesis/config/nit-standing-none
Output grid size               = (200,40,40)
Output grid patch size         = (1,1,1)
Model                          = AR
Verification scheme            = manual
AR model                       = order=(7,7,7),acf.shape=(10,10,10)
Velocity potential solver name = N4arma8velocity21High_amplitude_solverIdEE
Velocity potential solver      = wnmax=from (0,0) to (0,0.25) npoints (2,2),depth=12,domain=from (10,-12) to (10,3) npoints (1,128)
NIT transform                  = none
ACF variance = 1
WN variance = 0.000519022
Partition size                 = (21,10,10)
Finished part [1/160]Finished part [2/160]Finished part [3/160]Finished part [4/160]Finished part [5/160]Finished part [6/160]Finished part [7/160]Finished part [8/160]Finished part [9/160]Finished part [10/160]Finished part [11/160]Finished part [12/160]Finished part [13/160]Finished part [14/160]Finished part [15/160]Finished part [16/160]Finished part [17/160]Finished part [18/160]Finished part [19/160]Finished part [20/160]Finished part [21/160]Finished part [22/160]Finished part [23/160]Finished part [24/160]Finished part [25/160]Finished part [26/160]Finished part [27/160]Finished part [28/160]Finished part [29/160]Finished part [30/160]Finished part [31/160]Finished part [32/160]Finished part [33/160]Finished part [34/160]Finished part [35/160]Finished part [36/160]Finished part [37/160]Finished part [38/160]Finished part [39/160]Finished part [40/160]Finished part [41/160]Finished part [42/160]Finished part [43/160]Finished part [44/160]Finished part [45/160]Finished part [46/160]Finished part [47/160]Finished part [48/160]Finished part [49/160]Finished part [50/160]Finished part [51/160]Finished part [52/160]Finished part [53/160]Finished part [54/160]Finished part [55/160]Finished part [56/160]Finished part [57/160]Finished part [58/160]Finished part [59/160]Finished part [60/160]Finished part [61/160]Finished part [62/160]Finished part [63/160]Finished part [64/160]Finished part [65/160]Finished part [66/160]Finished part [67/160]Finished part [68/160]Finished part [69/160]Finished part [70/160]Finished part [71/160]Finished part [72/160]Finished part [73/160]Finished part [74/160]Finished part [75/160]Finished part [76/160]Finished part [77/160]Finished part [78/160]Finished part [79/160]Finished part [80/160]Finished part [81/160]Finished part [82/160]Finished part [83/160]Finished part [84/160]Finished part [85/160]Finished part [86/160]Finished part [87/160]Finished part [88/160]Finished part [89/160]Finished part [90/160]Finished part [91/160]Finished part [92/160]Finished part [93/160]Finished part [94/160]Finished part [95/160]Finished part [96/160]Finished part [97/160]Finished part [98/160]Finished part [99/160]Finished part [100/160]Finished part [101/160]Finished part [102/160]Finished part [103/160]Finished part [104/160]Finished part [105/160]Finished part [106/160]Finished part [107/160]Finished part [108/160]Finished part [109/160]Finished part [110/160]Finished part [111/160]Finished part [112/160]Finished part [113/160]Finished part [114/160]Finished part [115/160]Finished part [116/160]Finished part [117/160]Finished part [118/160]Finished part [119/160]Finished part [120/160]Finished part [121/160]Finished part [122/160]Finished part [123/160]Finished part [124/160]Finished part [125/160]Finished part [126/160]Finished part [127/160]Finished part [128/160]Finished part [129/160]Finished part [130/160]Finished part [131/160]Finished part [132/160]Finished part [133/160]Finished part [134/160]Finished part [135/160]Finished part [136/160]Finished part [137/160]Finished part [138/160]Finished part [139/160]Finished part [140/160]Finished part [141/160]Finished part [142/160]Finished part [143/160]Finished part [144/160]Finished part [145/160]Finished part [146/160]Finished part [147/160]Finished part [148/160]Finished part [149/160]Finished part [150/160]Finished part [151/160]Finished part [152/160]Finished part [153/160]Finished part [154/160]Finished part [155/160]Finished part [156/160]Finished part [157/160]Finished part [158/160]Finished part [159/160]Finished part [160/160]
Zeta size = (192,32,32)
'zeta.csv' -> 'zeta-none.csv'
Input file                     = /home/igankevich/workspace/arma-thesis/config/nit-standing-gramcharlier
Output grid size               = (200,40,40)
Output grid patch size         = (1,1,1)
Model                          = AR
Verification scheme            = manual
AR model                       = order=(7,7,7),acf.shape=(10,10,10)
Velocity potential solver name = N4arma8velocity21High_amplitude_solverIdEE
Velocity potential solver      = wnmax=from (0,0) to (0,0.25) npoints (2,2),depth=12,domain=from (10,-12) to (10,3) npoints (1,128)
NIT transform                  = dist=gram_charlier,skewness=3.25,kurtosis=2.4,interpolation_nodes=100,interpolation_order=12,gram_charlier_order=20
err = 0.995366
err = 0.472576
err = 0.608796
err = 0.61584
err = 0.639818
err = 12.4501
err = 9.45159e+10
err = 1.08018e+11
err = 3.05905e+13
err = 3.39774e+13
err = 1.70414e+14
err = 1.82818e+14
err = 1.83166e+14
err = 2.11267e+25
err = 9.15985e+25
err = 2.75794e+29
err = 2.79745e+29
err = 3.63216e+31
err = 3.64474e+31
err = 2.32998e+33
trim = 2
ACF variance = 1
WN variance = 0.000519022
Partition size                 = (21,10,10)
Finished part [1/160]Finished part [2/160]Finished part [3/160]Finished part [4/160]Finished part [5/160]Finished part [6/160]Finished part [7/160]Finished part [8/160]Finished part [9/160]Finished part [10/160]Finished part [11/160]Finished part [12/160]Finished part [13/160]Finished part [14/160]Finished part [15/160]Finished part [16/160]Finished part [17/160]Finished part [18/160]Finished part [19/160]Finished part [20/160]Finished part [21/160]Finished part [22/160]Finished part [23/160]Finished part [24/160]Finished part [25/160]Finished part [26/160]Finished part [27/160]Finished part [28/160]Finished part [29/160]Finished part [30/160]Finished part [31/160]Finished part [32/160]Finished part [33/160]Finished part [34/160]Finished part [35/160]Finished part [36/160]Finished part [37/160]Finished part [38/160]Finished part [39/160]Finished part [40/160]Finished part [41/160]Finished part [42/160]Finished part [43/160]Finished part [44/160]Finished part [45/160]Finished part [46/160]Finished part [47/160]Finished part [48/160]Finished part [49/160]Finished part [50/160]Finished part [51/160]Finished part [52/160]Finished part [53/160]Finished part [54/160]Finished part [55/160]Finished part [56/160]Finished part [57/160]Finished part [58/160]Finished part [59/160]Finished part [60/160]Finished part [61/160]Finished part [62/160]Finished part [63/160]Finished part [64/160]Finished part [65/160]Finished part [66/160]Finished part [67/160]Finished part [68/160]Finished part [69/160]Finished part [70/160]Finished part [71/160]Finished part [72/160]Finished part [73/160]Finished part [74/160]Finished part [75/160]Finished part [76/160]Finished part [77/160]Finished part [78/160]Finished part [79/160]Finished part [80/160]Finished part [81/160]Finished part [82/160]Finished part [83/160]Finished part [84/160]Finished part [85/160]Finished part [86/160]Finished part [87/160]Finished part [88/160]Finished part [89/160]Finished part [90/160]Finished part [91/160]Finished part [92/160]Finished part [93/160]Finished part [94/160]Finished part [95/160]Finished part [96/160]Finished part [97/160]Finished part [98/160]Finished part [99/160]Finished part [100/160]Finished part [101/160]Finished part [102/160]Finished part [103/160]Finished part [104/160]Finished part [105/160]Finished part [106/160]Finished part [107/160]Finished part [108/160]Finished part [109/160]Finished part [110/160]Finished part [111/160]Finished part [112/160]Finished part [113/160]Finished part [114/160]Finished part [115/160]Finished part [116/160]Finished part [117/160]Finished part [118/160]Finished part [119/160]Finished part [120/160]Finished part [121/160]Finished part [122/160]Finished part [123/160]Finished part [124/160]Finished part [125/160]Finished part [126/160]Finished part [127/160]Finished part [128/160]Finished part [129/160]Finished part [130/160]Finished part [131/160]Finished part [132/160]Finished part [133/160]Finished part [134/160]Finished part [135/160]Finished part [136/160]Finished part [137/160]Finished part [138/160]Finished part [139/160]Finished part [140/160]Finished part [141/160]Finished part [142/160]Finished part [143/160]Finished part [144/160]Finished part [145/160]Finished part [146/160]Finished part [147/160]Finished part [148/160]Finished part [149/160]Finished part [150/160]Finished part [151/160]Finished part [152/160]Finished part [153/160]Finished part [154/160]Finished part [155/160]Finished part [156/160]Finished part [157/160]Finished part [158/160]Finished part [159/160]Finished part [160/160]
Zeta size = (192,32,32)
'zeta.csv' -> 'zeta-gramcharlier.csv'
Input file                     = /home/igankevich/workspace/arma-thesis/config/nit-standing-skewnormal
Output grid size               = (200,40,40)
Output grid patch size         = (1,1,1)
Model                          = AR
Verification scheme            = manual
AR model                       = order=(7,7,7),acf.shape=(10,10,10)
Velocity potential solver name = N4arma8velocity21High_amplitude_solverIdEE
Velocity potential solver      = wnmax=from (0,0) to (0,0.25) npoints (2,2),depth=12,domain=from (10,-12) to (10,3) npoints (1,128)
NIT transform                  = dist=skew_normal,mean=0,stdev=1,alpha=1,interpolation_nodes=100,interpolation_order=12,gram_charlier_order=20
err = 0.893011
err = 0.269503
err = 0.173329
err = 0.0040605
err = 2.82799e+09
err = 4.3525e+25
err = 4.3525e+25
err = 7.2978e+33
err = 2.7618e+44
err = 3.06867e+44
err = 3.06867e+44
err = 3.06867e+44
err = 3.06867e+44
err = 3.06867e+44
err = 3.06867e+44
err = 3.06867e+44
err = 3.06867e+44
err = 3.06867e+44
err = 3.06867e+44
err = 3.06867e+44
trim = 4
ACF variance = 1
WN variance = 0.000519022
Partition size                 = (21,10,10)
Finished part [1/160]Finished part [2/160]Finished part [3/160]Finished part [4/160]Finished part [5/160]Finished part [6/160]Finished part [7/160]Finished part [8/160]Finished part [9/160]Finished part [10/160]Finished part [11/160]Finished part [12/160]Finished part [13/160]Finished part [14/160]Finished part [15/160]Finished part [16/160]Finished part [17/160]Finished part [18/160]Finished part [19/160]Finished part [20/160]Finished part [21/160]Finished part [22/160]Finished part [23/160]Finished part [24/160]Finished part [25/160]Finished part [26/160]Finished part [27/160]Finished part [28/160]Finished part [29/160]Finished part [30/160]Finished part [31/160]Finished part [32/160]Finished part [33/160]Finished part [34/160]Finished part [35/160]Finished part [36/160]Finished part [37/160]Finished part [38/160]Finished part [39/160]Finished part [40/160]Finished part [41/160]Finished part [42/160]Finished part [43/160]Finished part [44/160]Finished part [45/160]Finished part [46/160]Finished part [47/160]Finished part [48/160]Finished part [49/160]Finished part [50/160]Finished part [51/160]Finished part [52/160]Finished part [53/160]Finished part [54/160]Finished part [55/160]Finished part [56/160]Finished part [57/160]Finished part [58/160]Finished part [59/160]Finished part [60/160]Finished part [61/160]Finished part [62/160]Finished part [63/160]Finished part [64/160]Finished part [65/160]Finished part [66/160]Finished part [67/160]Finished part [68/160]Finished part [69/160]Finished part [70/160]Finished part [71/160]Finished part [72/160]Finished part [73/160]Finished part [74/160]Finished part [75/160]Finished part [76/160]Finished part [77/160]Finished part [78/160]Finished part [79/160]Finished part [80/160]Finished part [81/160]Finished part [82/160]Finished part [83/160]Finished part [84/160]Finished part [85/160]Finished part [86/160]Finished part [87/160]Finished part [88/160]Finished part [89/160]Finished part [90/160]Finished part [91/160]Finished part [92/160]Finished part [93/160]Finished part [94/160]Finished part [95/160]Finished part [96/160]Finished part [97/160]Finished part [98/160]Finished part [99/160]Finished part [100/160]Finished part [101/160]Finished part [102/160]Finished part [103/160]Finished part [104/160]Finished part [105/160]Finished part [106/160]Finished part [107/160]Finished part [108/160]Finished part [109/160]Finished part [110/160]Finished part [111/160]Finished part [112/160]Finished part [113/160]Finished part [114/160]Finished part [115/160]Finished part [116/160]Finished part [117/160]Finished part [118/160]Finished part [119/160]Finished part [120/160]Finished part [121/160]Finished part [122/160]Finished part [123/160]Finished part [124/160]Finished part [125/160]Finished part [126/160]Finished part [127/160]Finished part [128/160]Finished part [129/160]Finished part [130/160]Finished part [131/160]Finished part [132/160]Finished part [133/160]Finished part [134/160]Finished part [135/160]Finished part [136/160]Finished part [137/160]Finished part [138/160]Finished part [139/160]Finished part [140/160]Finished part [141/160]Finished part [142/160]Finished part [143/160]Finished part [144/160]Finished part [145/160]Finished part [146/160]Finished part [147/160]Finished part [148/160]Finished part [149/160]Finished part [150/160]Finished part [151/160]Finished part [152/160]Finished part [153/160]Finished part [154/160]Finished part [155/160]Finished part [156/160]Finished part [157/160]Finished part [158/160]Finished part [159/160]Finished part [160/160]
Zeta size = (192,32,32)
'zeta.csv' -> 'zeta-skewnormal.csv'
#+end_example
** Download arma-benchmarks data from repository
#+begin_src sh :exports none :results verbatim
set -e
dir=build/arma-benchmarks
mkdir -p $dir
if ! test -d "$dir/.git"
then
    git clone https://github.com/igankevich/arma-benchmarks $dir
fi
cd $dir
git checkout master
git pull
git checkout 5c07dd4b6a334cc869e81588b2a2a772d6b85e43
#+end_src

#+RESULTS:
:       origin/master.
: Already up-to-date.

